---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitPathOffset
source: html/6eec48f1-11dd-bb3b-cdc2-86aba7677698.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitPathOffset Property

The default circuit path offset for newly created circuit.

## Syntax (C#)
```csharp
public double CircuitPathOffset { get; set; }
```